hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cm/F2838x_ROM/driverlib_cm/cmmpu.h
//###########################################################################
//
// FILE:   cmmpu.h
//
// TITLE:  Driver for the uDMA & EMAC memory protection unit (MPU).
//
//###########################################################################
// $TI Release:  $
// $Release Date:  $
// $Copyright:  $
//###########################################################################

#ifndef CMMPU_H
#define CMMPU_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//*****************************************************************************
//
//! \addtogroup cmmpu_api CMMPU
//! @{
//
//*****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include "debug.h"
#include "interrupt.h"
#include "inc_cm/hw_cmmpu.h"
#include "inc_cm/hw_ints.h"
#include "inc_cm/hw_memmap.h"
#include "inc_cm/hw_types.h"

//*****************************************************************************
//
// Defines for the API.
//
//*****************************************************************************
//*****************************************************************************
//
// Key for accessing Access Violation related registers.
//
//*****************************************************************************
#define CMMPU_ACC_VIO_KEY          0xA5A50000U //!< Key for ACC VIO Registers

//*****************************************************************************
//
// Flags for setting/clearing/returning the access violation interrupt flag
// status, to be passed to CMMPU_setAccessViolationFlags() &
// CMMPU_setAccessViolationFlags() as flags parameter & returned by
// CMMPU_getAccessViolationFlags().
//
//*****************************************************************************
#define CMMPU_ACC_VIO_FLAGS_READ   CMMPU_ACC_VIO_FLAGS_RD //!< Read Violation
#define CMMPU_ACC_VIO_FLAGS_WRITE  CMMPU_ACC_VIO_FLAGS_WR //!< Write Violation

//*****************************************************************************
//
// Values that can be passed to CMMPU_setRegionAttributes() and
// CMMPU_getRegionAttributes() as regionNum parameter.
//
//*****************************************************************************
#define CMMPU_RGN_0                0x0U //!< Select uDMA/EMAC MPU Region 0
#define CMMPU_RGN_1                0x1U //!< Select uDMA/EMAC MPU Region 1
#define CMMPU_RGN_2                0x2U //!< Select uDMA/EMAC MPU Region 2
#define CMMPU_RGN_3                0x3U //!< Select uDMA/EMAC MPU Region 3
#define CMMPU_RGN_4                0x4U //!< Select uDMA/EMAC MPU Region 4
#define CMMPU_RGN_5                0x5U //!< Select uDMA/EMAC MPU Region 5
#define CMMPU_RGN_6                0x6U //!< Select uDMA/EMAC MPU Region 6
#define CMMPU_RGN_7                0x7U //!< Select uDMA/EMAC MPU Region 7

//*****************************************************************************
//
// Flags to enable or disable a region, to be passed to
// CMMPU_setRegionAttributes().
//
//*****************************************************************************
#define CMMPU_RGN_ENABLE           0x1U //!< Enable MPU Region
#define CMMPU_RGN_DISABLE          0x0U //!< Disable MPU Region

//*****************************************************************************
//
// Flags for the access permissions to be passed to CMMPU_setRegionAttributes().
//
//*****************************************************************************
#define CMMPU_RGN_PERM_READ_ONLY   0x00U //!< Read Only Access
#define CMMPU_RGN_PERM_NO_ACCESS   0x20U //!< No Access(R/W)
#define CMMPU_RGN_PERM_FULL_ACCESS 0x10U //!< Full Access(R/W)

//*****************************************************************************
//
// Flags for the region size to be passed to CMMPU_setRegionAttributes().
//
//*****************************************************************************
#define CMMPU_RGN_SIZE_1K          (0x0U  << 8U) //!< Region Size is 1K-bytes
#define CMMPU_RGN_SIZE_2K          (0x1U  << 8U) //!< Region Size is 2K-bytes
#define CMMPU_RGN_SIZE_4K          (0x2U  << 8U) //!< Region Size is 4K-bytes
#define CMMPU_RGN_SIZE_8K          (0x3U  << 8U) //!< Region Size is 8K-bytes
#define CMMPU_RGN_SIZE_16K         (0x4U  << 8U) //!< Region Size is 16K-bytes
#define CMMPU_RGN_SIZE_32K         (0x5U  << 8U) //!< Region Size is 32K-bytes
#define CMMPU_RGN_SIZE_64K         (0x6U  << 8U) //!< Region Size is 64K-bytes
#define CMMPU_RGN_SIZE_128K        (0x7U  << 8U) //!< Region Size is 128K-bytes
#define CMMPU_RGN_SIZE_256K        (0x8U  << 8U) //!< Region Size is 256K-bytes
#define CMMPU_RGN_SIZE_512K        (0x9U  << 8U) //!< Region Size is 512K-bytes
#define CMMPU_RGN_SIZE_1M          (0xAU  << 8U) //!< Region Size is 1M-bytes
#define CMMPU_RGN_SIZE_2M          (0xBU  << 8U) //!< Region Size is 2M-bytes
#define CMMPU_RGN_SIZE_4M          (0xCU  << 8U) //!< Region Size is 4M-bytes
#define CMMPU_RGN_SIZE_8M          (0xDU  << 8U) //!< Region Size is 8M-bytes
#define CMMPU_RGN_SIZE_16M         (0xEU  << 8U) //!< Region Size is 16M-bytes
#define CMMPU_RGN_SIZE_32M         (0xFU  << 8U) //!< Region Size is 32M-bytes
#define CMMPU_RGN_SIZE_64M         (0x10U << 8U) //!< Region Size is 64M-bytes
#define CMMPU_RGN_SIZE_128M        (0x11U << 8U) //!< Region Size is 128M-bytes
#define CMMPU_RGN_SIZE_256M        (0x12U << 8U) //!< Region Size is 256M-bytes
#define CMMPU_RGN_SIZE_512M        (0x13U << 8U) //!< Region Size is 512M-bytes
#define CMMPU_RGN_SIZE_1G          (0x14U << 8U) //!< Region Size is 1G-bytes
#define CMMPU_RGN_SIZE_2G          (0x15U << 8U) //!< Region Size is 2G-bytes
#define CMMPU_RGN_SIZE_4G          (0x16U << 8U) //!< Region Size is 4G-bytes

//*****************************************************************************
//
// Flags for the sub-region to be passed to CMMPU_setRegionAttributes().
//
//*****************************************************************************
#define CMMPU_SUB_RGN_DISABLE_0    0x00010000U //!< Disable sub-region 0
#define CMMPU_SUB_RGN_DISABLE_1    0x00020000U //!< Disable sub-region 1
#define CMMPU_SUB_RGN_DISABLE_2    0x00040000U //!< Disable sub-region 2
#define CMMPU_SUB_RGN_DISABLE_3    0x00080000U //!< Disable sub-region 3
#define CMMPU_SUB_RGN_DISABLE_4    0x00100000U //!< Disable sub-region 4
#define CMMPU_SUB_RGN_DISABLE_5    0x00200000U //!< Disable sub-region 5
#define CMMPU_SUB_RGN_DISABLE_6    0x00400000U //!< Disable sub-region 6
#define CMMPU_SUB_RGN_DISABLE_7    0x00800000U //!< Disable sub-region 7

//*****************************************************************************
//
// Mask for MPU region attributes to be used by CMMPU_setRegionAttributes().
//
//*****************************************************************************

